Revit 2027 API
CommandEventArgs.ActiveDocument Property
 The active document.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document ActiveDocument { get; }
Public ReadOnly Property ActiveDocument As Document
	Get
public:
property Document^ ActiveDocument {
	Document^ get ();
}
member ActiveDocument : Document with get
Property Value
Document
See Also
Reference
CommandEventArgs Class
Autodesk.Revit.UI.Events Namespace